{
	"name": "2 HealthCare SQL Pool Security RLS DDM",
	"properties": {
		"folder": {
			"name": "healthcare_information_protection/analysis"
		},
		"content": {
			"query": "/******Important – Do not use in production, for demonstration purposes only – please review the legal notices by clicking the following link****/\n---DisclaimerLink:  https://healthcaredemoapp.azurewebsites.net/#/disclaimer\n---License agreement: https://github.com/microsoft/Azure-Analytics-and-AI-Engagement/blob/main/HealthCare/License.md\n\n/* **DISCLAIMER**\nBy accessing this code, you acknowledge the code is made available for presentation and demonstration purposes only and that the code: (1) is not subject to SOC 1 and SOC 2 compliance audits; (2) is not designed or intended to be a substitute for the professional advice, diagnosis, treatment, or judgment of a certified financial services professional; (3) is not designed, intended or made available as a medical device; and (4) is not designed or intended to be a substitute for professional medical advice, diagnosis, treatment or judgement. Do not use this code to replace, substitute, or provide professional financial advice or judgment, or to replace, substitute or provide medical advice, diagnosis, treatment or judgement. You are solely responsible for ensuring the regulatory, legal, and/or contractual compliance of any use of the code, including obtaining any authorizations or consents, and any solution you choose to build that incorporates this code in whole or in part. */\n\n/* Row level Security (RLS) in Azure Synapse enables us to use group membership to control access to rows in a table.\n\tAzure Synapse applies the access restriction every time the data access is attempted from any user. \n\tLet see how we can implement row level security and Dynamic Data Masking in Azure Synapse.*/\n\n--Step 1\nSELECT count(*) as 'TotalEmp' FROM hpi.HospitalEmpPIIData ; \nSELECT * FROM hpi.HospitalEmpPIIData ;\n\n-- Step 2 Let now test the filtering predicate (for state), by selecting data from the HospitalEmpPIIData table as Your Alias\n-- ChiefOperatingManager 'Spencer' should be able to see all rows in the table.\n-- Spencer is logged in as demo-healthcare-user.\nEXECUTE AS USER ='demo-healthcare-user@cloudlabsai.ms'\nSELECT count(*) as 'TotalEmp' FROM hpi.HospitalEmpPIIData ;\nSELECT * FROM hpi.HospitalEmpPIIData;\nrevert\n\n-- Step 3 Let us test the same for other user.\n-- CareManager 'Jim' should be able to see only Miami State and BillingStaff Data in the table.\n-- Jim is logged in as demo-healthcare-user-02.\nEXECUTE AS USER ='demo-healthcare-user-02@cloudlabsai.ms'\nSELECT count(*) as 'TotalEmp' FROM hpi.HospitalEmpPIIData ;\nSELECT \n    *\nFROM \n    hpi.HospitalEmpPIIData ;\nrevert\n\n\n\n\n\n\n",
			"metadata": {
				"language": "sql"
			},
			"currentConnection": {
				"databaseName": "syndpag83datadev",
				"poolName": "syndpag83datadev"
			},
			"resultLimit": 5000
		},
		"type": "SqlQuery"
	}
}